```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # onepassword_item.playground_secrets will be created
  + resource "onepassword_item" "playground_secrets" {
      + category = "password"
      + id       = (known after apply)
      + password = (sensitive value)
      + title    = "Playground Secrets"
      + uuid     = (known after apply)
      + vault    = "cdhtsaeb6xl7lk4nyz5qo6rmv4"

      + section {
          + id    = (known after apply)
          + label = "Google"

          + field {
              + id    = (known after apply)
              + label = "Workload Identity"
              + type  = "CONCEALED"
              + value = (sensitive value)
            }
        }
    }

  # module.github-repository.github_issue_label.main["Terraform"] will be created
  + resource "github_issue_label" "main" {
      + color       = "e99695"
      + description = "Execute terraform workflow"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "Terraform"
      + repository  = "playground.ashdavies.dev"
      + url         = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
<!-- thollander/actions-comment-pull-request "terraform-plan" -->